{
  "id": "bd0088a5-c133-4b20-b129-ec9968b16ef3",
  "queryName": "CloudTrail Log Files S3 Bucket is Publicly Accessible",
  "severity": "HIGH",
  "category": "Observability",
  "descriptionText": "CloudTrail Log Files S3 Bucket should not be publicly accessible",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/cloudtrail#s3_bucket_name",
  "platform": "Terraform",
  "descriptionID": "2f7c6ca4",
  "cloudProvider": "aws",
  "cwe": "668",
  "detailedDescriptionText": "AWS CloudTrail log files should never be stored in publicly accessible S3 buckets. CloudTrail logs contain detailed information about all API activities in your AWS account, including sensitive operations, user identities, IP addresses, and timestamps. Making these logs publicly accessible creates a severe security risk and violates security best practices.\n\nWhen CloudTrail log buckets are configured with public access (e.g., using ACLs like 'public-read' or overly permissive bucket policies), your entire AWS account activity history becomes vulnerable to unauthorized access. Attackers can use this information to map your infrastructure, identify security gaps, gather intelligence for social engineering attacks, or plan targeted attacks against your organization.\n\nAlways configure S3 buckets that store CloudTrail logs with private ACLs and restrictive bucket policies that grant access only to authorized administrators and security monitoring systems. Additionally, consider enabling S3 bucket versioning, server-side encryption, and access logging to further protect your CloudTrail logs and detect any unauthorized access attempts.\n\nSecuring CloudTrail logs is essential for maintaining the integrity of your audit trail and ensuring you have reliable records for security monitoring, incident response, and compliance purposes. Exposing these logs publicly not only risks your infrastructure's security but may also violate compliance requirements under standards like PCI DSS, HIPAA, SOC 2, and others that mandate the protection of audit logs."
}
