{
  "id": "54378d69-dd7c-4b08-a43e-80d563396857",
  "queryName": "MSK Broker Is Publicly Accessible",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "Public AWS MSK allows anyone to interact with the Apache Kafka broker, therefore increasing the opportunity for malicious activity. To prevent such a scenario, it is recommended for AWS MSK to not be publicly accessible",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/msk_cluster#public_access",
  "platform": "Terraform",
  "descriptionID": "6ad9c2af",
  "cloudProvider": "aws",
  "cwe": "284",
  "detailedDescriptionText": "AWS Managed Streaming for Kafka (MSK) clusters should not be configured with public accessibility. This vulnerability occurs when an MSK cluster's broker nodes are configured with the 'public_access' block set to a type other than 'DISABLED', allowing direct access from the public internet.\n\nPublicly accessible MSK clusters create significant security risks as they expose Kafka brokers directly to the internet, potentially allowing unauthorized users to access, modify, or delete sensitive streaming data. Kafka's built-in authentication mechanisms may not be sufficient to protect against sophisticated attacks when exposed to the public internet. Additionally, public exposure increases the risk of denial-of-service attacks that could disrupt critical data pipelines and dependent applications.\n\nTo properly secure your MSK clusters, configure the 'public_access' block with the type set to 'DISABLED' in your Terraform configuration, or omit the 'public_access' block entirely as it defaults to disabled. Instead of public access, implement private connectivity options such as VPC peering, Transit Gateway, or AWS PrivateLink to allow access from authorized applications and services.\n\nImplement additional security measures such as encryption in transit using TLS, client authentication using mutual TLS or SASL/SCRAM, and fine-grained access control with Kafka ACLs. Regularly audit your MSK cluster configurations and access patterns to ensure they maintain a secure posture. By keeping your Kafka brokers private and implementing proper access controls, you significantly reduce the risk of unauthorized access to your streaming data infrastructure."
}
