{
  "id": "b26d2b7e-60f6-413d-a3a1-a57db24aa2b3",
  "queryName": "SNS Topic is Publicly Accessible",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "SNS Topic Policy should not allow any principal to access",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/sns_topic",
  "platform": "Terraform",
  "descriptionID": "52e85de5",
  "cloudProvider": "aws",
  "cwe": "284",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Configuring an Amazon SNS topic to be publicly accessible creates a critical security vulnerability that can lead to unauthorized message publishing, subscription management, and potential data leakage. When an SNS topic policy includes statements with 'Effect': 'Allow' and 'Principal': '*', it effectively removes access controls, making the topic accessible to anyone on the internet.\n\nPublicly accessible SNS topics present several serious security risks:\n\n1. Unauthorized Message Publishing: Malicious actors can publish messages to your topic, potentially triggering unwanted downstream processes, causing service disruption, or spreading misinformation to your subscribers.\n\n2. Information Disclosure: If your SNS topic contains sensitive data or internal operational messages, public access could lead to unintended data exposure and potential compliance violations.\n\n3. Resource Consumption: Attackers can abuse public access to generate excessive message traffic, potentially leading to increased AWS costs and legitimate message delays.\n\n4. Subscription Management: Public access may allow unauthorized users to subscribe or unsubscribe endpoints, disrupting your communication channels.\n\nTo secure your SNS topics:\n1. Always explicitly specify trusted AWS accounts or IAM principals in your topic policies\n2. Implement the principle of least privilege by granting only necessary permissions\n3. Use condition statements to restrict access based on source IP, VPC endpoints, or other relevant attributes\n4. Regularly audit SNS topic policies to identify and remediate any overly permissive settings\n5. Enable CloudTrail logging to monitor for suspicious SNS activity\n\nBy properly securing your SNS topics, you help prevent unauthorized access and protect the integrity of your messaging infrastructure in AWS."
}
