{
  "id": "4f615f3e-fb9c-4fad-8b70-2e9f781806ce",
  "queryName": "DB Security Group Open To Large Scope",
  "severity": "HIGH",
  "category": "Networking and Firewall",
  "descriptionText": "The IP address in a DB Security Group must not have more than 256 hosts.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/db_security_group",
  "platform": "Terraform",
  "descriptionID": "cd091033",
  "cloudProvider": "aws",
  "cwe": "200",
  "detailedDescriptionText": "AWS DB Security Groups should restrict access to databases by limiting the CIDR blocks in ingress rules to only the necessary IP ranges. When a DB Security Group allows access to a CIDR block that encompasses more than 256 hosts (using a subnet mask smaller than /24), it significantly increases the attack surface and risk of unauthorized access to your database resources.\n\nAllowing database access from broad IP ranges violates the principle of least privilege and creates unnecessary security risks. Databases often contain sensitive information, and excessive network access increases the potential for data breaches, credential theft, and other security incidents. Even within internal networks, database access should be restricted to only the applications and systems that genuinely need it.\n\nTo mitigate this risk, configure your DB Security Group ingress rules with CIDR blocks that use a subnet mask of /24 or larger (e.g., /25, /26, etc.) to limit the number of hosts that can access your database. Ideally, database access should be restricted to specific IP addresses or small ranges that represent your application servers or administrators' workstations. For example, use '10.0.0.5/32' for a single host or '10.0.0.0/28' for a small range of 16 addresses.\n\nFor enhanced security, consider using VPC Security Groups instead of DB Security Groups (which are legacy resources), implementing network ACLs, using bastion hosts for administrative access, and leveraging encryption and strong authentication mechanisms for your databases. Regularly review and audit your security group rules to ensure they remain aligned with the principle of least privilege."
}
