{
  "id": "a4966c4f-9141-48b8-a564-ffe9959945bc",
  "queryName": "S3 Bucket With All Permissions",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "S3 Buckets should not have all permissions, as to prevent leaking private information to the entire internet or allow unauthorized data tampering / deletion. This means the 'Effect' must not be 'Allow' when the 'Action' is '*', for all Principals.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/s3_bucket",
  "platform": "Terraform",
  "descriptionID": "aec8fae9",
  "cloudProvider": "aws",
  "cwe": "250",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Configuring an S3 bucket with overly permissive permissions, especially granting all actions ('*') to all principals, creates a severe security vulnerability that can lead to unauthorized data access, modification, or deletion. This configuration effectively makes your S3 bucket and its contents accessible to anyone who discovers it.\n\nWhen an S3 bucket policy includes statements with 'Effect': 'Allow', 'Action': '*', and a wide range of principals, it bypasses all access controls and can lead to data breaches, data loss, and potential compliance violations. Attackers can exploit these permissions to access sensitive information, insert malicious content, or completely delete your data.\n\nTo protect your S3 buckets:\n1. Follow the principle of least privilege by granting only the specific permissions required for legitimate operations\n2. Restrict access to specific AWS accounts or IAM principals that need it\n3. Use conditional statements to further limit access based on IP ranges, VPC endpoints, or other contextual factors\n4. Implement S3 bucket policies that explicitly deny public access\n5. Enable S3 Block Public Access settings at both the bucket and account levels\n6. Regularly audit your S3 bucket permissions using AWS tools like IAM Access Analyzer\n\nProper S3 bucket permission management is essential for maintaining data security in the cloud. By carefully controlling who can perform which actions on your S3 resources, you significantly reduce the risk of unauthorized access and potential data breaches."
}
