{
  "id": "ad9dabc7-7839-4bae-a957-aa9120013f39",
  "queryName": "Lambda With Vulnerable Policy",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "The attribute 'action' should not have wildcard",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/lambda_permission#action",
  "platform": "Terraform",
  "descriptionID": "5db376a3",
  "cloudProvider": "aws",
  "cwe": "155",
  "oldSeverity": "MEDIUM",
  "detailedDescriptionText": "AWS Lambda permission policies should never use wildcards in the 'action' attribute. This vulnerability occurs when an 'aws_lambda_permission' resource is created with an action set to 'lambda:*' instead of specifying a precise Lambda action, creating a significant security risk.\n\nUsing wildcards in Lambda permission policies violates the principle of least privilege and potentially allows more access than necessary to external entities. When a wildcard action such as 'lambda:*' is specified, it grants permissions to perform any Lambda operation on the function, not just invoking it. This could include permissions to update the function code, configuration, or concurrency settings, delete the function, or view sensitive function settings.\n\nTo properly secure your Lambda functions, always specify the exact action required in the 'action' attribute of the 'aws_lambda_permission' resource. In most cases, this should be 'lambda:InvokeFunction' when the intention is to allow a service or account to invoke the function. If additional specific actions are needed, list them individually rather than using a wildcard.\n\nRegularly audit your Lambda function permissions to ensure they follow the principle of least privilege. Use AWS CloudTrail to monitor Lambda function access and configuration changes, and implement alerts for suspicious activities. By specifying exact permissions rather than using wildcards, you significantly reduce the risk surface and potential impact of a security breach involving your Lambda functions."
}
