{
  "id": "f0d8781f-1991-4958-9917-d39283b168a0",
  "queryName": "DB Snapshot Is Public",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "The DB snapshot is public. This means that anyone can access the snapshot and restore the database. This can lead to unauthorized access to sensitive data.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/db_snapshot#shared_accounts-1",
  "platform": "Terraform",
  "descriptionID": "f0d8781f",
  "cloudProvider": "aws",
  "cwe": "200",
  "detailedDescriptionText": "AWS DB snapshots should never be configured as public by adding 'all' to the 'shared_accounts' attribute. Public snapshots create severe security risks by allowing anyone with an AWS account to access and restore your database snapshot, potentially exposing all data contained within your database to unauthorized users.\n\nDatabase snapshots often contain a complete copy of your production data, including sensitive information such as personal identifiable information (PII), financial records, authentication credentials, and proprietary business data. When a snapshot is made public, this data becomes accessible to anyone who discovers the snapshot's existence, creating a significant risk of data breaches, identity theft, financial fraud, and other security incidents.\n\nTo securely share DB snapshots when necessary, use specific AWS account IDs in the 'shared_accounts' attribute instead of 'all'. This ensures that only explicitly authorized AWS accounts can access your snapshot. Alternatively, leave the 'shared_accounts' attribute empty or omit it entirely to keep the snapshot private to your AWS account.\n\nRegularly audit your DB snapshots to identify any that may have been accidentally made public, and implement proper governance controls, such as IAM policies and AWS Config rules, to prevent the creation of public snapshots. Remember that database snapshots should be treated with the same level of security as the production databases they were created from."
}
