{
  "id": "b4c6d7e8-f9a1-4bcd-89ef-01234abcd567",
  "queryName": "Fine-Grained Access Control Disabled for OpenSearch/Elasticsearch",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "Ensures that AWS OpenSearch and Elasticsearch domains have fine-grained access control enabled. Without this setting, access permissions cannot be enforced at a granular level, potentially leading to unauthorized access.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/opensearch_domain#advanced_security_options",
  "platform": "Terraform",
  "descriptionID": "b4c6d7e8",
  "cloudProvider": "aws",
  "cwe": "284",
  "detailedDescriptionText": "AWS OpenSearch and Elasticsearch domains should always have fine-grained access control enabled to properly secure your search data. This vulnerability occurs when a domain is configured with 'advanced_security_options.enabled' set to false or when the 'advanced_security_options' block is omitted entirely.\n\nFine-grained access control is critical for enforcing proper authentication and authorization for your search domain. Without this feature enabled, you cannot implement role-based access controls, field-level security, or document-level security, which are essential for protecting sensitive data stored in your search indexes. This could lead to unauthorized access, data breaches, or compliance violations for domains containing sensitive or regulated information.\n\nTo properly secure your OpenSearch or Elasticsearch domain, always include the 'advanced_security_options' block with 'enabled' set to true in your Terraform configuration. For complete security, also set 'internal_user_database_enabled' to true or configure integration with existing identity providers through SAML or Amazon Cognito to manage user authentication properly.\n\nImplementing fine-grained access control for OpenSearch and Elasticsearch domains is not only a security best practice but also essential for meeting compliance requirements such as GDPR, HIPAA, PCI DSS, and other regulatory standards that mandate strict access controls for sensitive data. Additionally, when properly configured, this feature allows you to implement the principle of least privilege, ensuring that users and applications have only the access necessary to perform their functions without exposing unnecessary data."
}
