{
  "id": "3206240f-2e87-4e58-8d24-3e19e7c83d7c",
  "queryName": "ECS Service Admin Role Is Present",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "ECS Services must not have Admin roles, which means the attribute 'iam_role' must not be an admin role",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/ecs_service",
  "platform": "Terraform",
  "descriptionID": "0503dc3c",
  "cloudProvider": "aws",
  "cwe": "732",
  "detailedDescriptionText": "AWS ECS services should never be assigned administrative IAM roles. This vulnerability occurs when an ECS service is configured with an 'iam_role' that has administrative privileges, creating a significant security risk through privilege escalation and potential compromise of your container workloads.\n\nAssigning administrative roles to ECS services violates the principle of least privilege and creates an unnecessarily large attack surface. If the ECS service or its tasks are compromised, an attacker could leverage these administrative permissions to gain extensive access to your AWS account, potentially leading to data breaches, resource manipulation, or even complete account takeover.\n\nTo properly secure your ECS services, always follow the principle of least privilege by creating and assigning IAM roles with only the specific permissions required for the service to function correctly. For example, an ECS service might only need permissions to pull images from ECR, write logs to CloudWatch, and access specific AWS resources required by the application.\n\nWhen configuring IAM roles for ECS services, avoid using roles with administrative policies like 'AdministratorAccess' or custom policies with overly broad permissions. Instead, create dedicated service roles with fine-grained permissions specific to each service's requirements. Regularly review and audit these roles to ensure they maintain the minimum necessary privileges as your application requirements evolve. Using AWS IAM Access Analyzer can help identify overly permissive roles and suggest improvements to enhance your security posture."
}
