{
  "id": "46883ce1-dc3e-4b17-9195-c6a601624c73",
  "queryName": "Default Security Groups With Unrestricted Traffic",
  "severity": "HIGH",
  "category": "Networking and Firewall",
  "descriptionText": "Check if default security group does not restrict all inbound and outbound traffic.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/default_security_group",
  "platform": "Terraform",
  "descriptionID": "d218356d",
  "cloudProvider": "aws",
  "cwe": "285",
  "detailedDescriptionText": "Default security groups in AWS should never allow unrestricted traffic from the internet. This vulnerability occurs when a default security group is configured with ingress or egress rules that permit traffic from '0.0.0.0/0' (all IPv4 addresses) or '::/0' (all IPv6 addresses), creating a significant security risk to your cloud environment.\n\nDefault security groups are automatically created with each VPC and are often overlooked during security reviews. When these groups allow unrestricted traffic, they effectively circumvent network security controls and provide potential attackers with direct access to your resources. This violates the principle of least privilege and creates an unnecessary attack surface that could lead to unauthorized access, data breaches, or service disruptions.\n\nTo mitigate this risk, always configure default security groups with restrictive rules that allow only necessary traffic from specific IP ranges. For ingress rules, restrict access to known IP addresses or CIDR blocks that require access to your resources. For egress rules, limit outbound traffic to only the specific destinations your applications need to communicate with, rather than allowing all outbound traffic.\n\nAdditionally, consider implementing a 'deny by default' policy for all security groups, using AWS Organizations Service Control Policies (SCPs) or IAM policies to prevent the creation of overly permissive security group rules, and regularly auditing your security groups to identify and remediate any that allow unrestricted traffic. Properly secured default security groups are an essential component of a defense-in-depth strategy for your AWS environment."
}
