{
  "id": "64a222aa-7793-4e40-915f-4b302c76e4d4",
  "queryName": "S3 Bucket ACL Grants WRITE_ACP Permission",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "S3 Buckets should not allow WRITE_ACP permission to the S3 Bucket Access Control List in order to prevent AWS accounts or IAM users to modify access control permissions to the bucket.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/s3_bucket_acl",
  "platform": "Terraform",
  "descriptionID": "addee63f",
  "cloudProvider": "aws",
  "cwe": "732",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Granting WRITE_ACP (Write Access Control Policy) permissions on S3 buckets represents a critical security risk that could lead to complete compromise of your data. This permission allows a user to modify the bucket's Access Control Lists (ACLs), effectively giving them the ability to grant themselves or others full access to the bucket, regardless of other security controls in place.\n\nWhen a bucket has WRITE_ACP permissions granted to anyone other than the bucket owner or trusted administrators, it creates a security vulnerability that can be exploited to:\n1. Grant full access to unauthorized parties\n2. Remove access restrictions protecting sensitive data\n3. Create backdoor access that bypasses monitoring controls\n4. Facilitate data exfiltration or destruction\n\nThe WRITE_ACP permission is particularly dangerous because:\n- It allows modification of the fundamental access control mechanism for the bucket\n- It can be used to override other security controls and policies\n- It creates a privilege escalation path that could lead to full bucket compromise\n- The changes made can be difficult to detect without proper monitoring\n\nTo secure your S3 buckets:\n1. Never grant WRITE_ACP permissions in bucket ACLs to anyone outside of trusted administrators\n2. Use IAM policies with strict conditions rather than bucket ACLs for access control\n3. Implement S3 Block Public Access settings at both bucket and account levels\n4. Monitor CloudTrail for S3 control plane events, particularly PutBucketAcl operations\n5. Consider using S3 Object Lock with compliance mode for critical data that should be immutable\n\nProtecting the integrity of your bucket's access controls is essential for maintaining the security of your data in AWS. By carefully restricting who can modify bucket ACLs, you prevent unauthorized access and protect against data breaches."
}
