{
  "id": "f1g2h3i4-j5k6-7lmn-8opq-9012rstuvwxy",
  "queryName": "IMDSv1 Enabled",
  "severity": "HIGH",
  "category": "Best Practices",
  "descriptionText": "Ensures that AWS Instance Metadata Service Version 1 (IMDSv1) is disabled. IMDSv1 is vulnerable to SSRF attacks and should be replaced with IMDSv2 with session tokens required.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/instance#metadata-options",
  "platform": "Terraform",
  "descriptionID": "f1g2h3i4",
  "cloudProvider": "aws",
  "cwe": "284",
  "detailedDescriptionText": "AWS EC2 instances and launch templates should be configured to use Instance Metadata Service Version 2 (IMDSv2) exclusively by requiring HTTP tokens. This vulnerability occurs when the 'http_tokens' parameter is set to 'optional' or omitted from the 'metadata_options' block, which allows IMDSv1 to be used.\n\nIMDSv1 is vulnerable to Server-Side Request Forgery (SSRF) attacks because it doesn't require any authentication to access the metadata service at 169.254.169.254. If an attacker can exploit an SSRF vulnerability in an application running on the EC2 instance, they could potentially access sensitive information from the metadata service, including IAM credentials, user data, and other configuration details. This vulnerability has been exploited in major security breaches.\n\nTo properly secure your EC2 instances, always configure the 'metadata_options' block with 'http_tokens' set to 'required', which enforces the use of IMDSv2 with session tokens. This adds a layer of protection by requiring requests to include a token that can only be obtained from within the instance, significantly reducing the risk of SSRF attacks against the metadata service.\n\nImplementing IMDSv2 is especially important for instances that run web applications, API servers, or any service that processes user input or external requests, as these are more likely to have SSRF vulnerabilities that could be exploited. Additionally, consider setting 'http_endpoint' to 'disabled' for instances that don't need access to IMDS at all, further reducing the attack surface."
}
