{
  "id": "4a800e14-c94a-442d-9067-5a2e9f6c0a4c",
  "queryName": "ELB Using Weak Ciphers",
  "severity": "HIGH",
  "category": "Encryption",
  "descriptionText": "ELB Predefined or Custom Security Policies must not use weak ciphers, to reduce the risk of the SSL connection between the client and the load balancer being exploited. That means the 'name' of 'policy_attributes' must not coincide with any of a predefined list of weak ciphers.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/load_balancer_policy",
  "platform": "Terraform",
  "descriptionID": "546bf472",
  "cloudProvider": "aws",
  "cwe": "326",
  "detailedDescriptionText": "AWS Elastic Load Balancers (ELBs) should be configured to use only strong SSL/TLS ciphers to secure client connections. This vulnerability occurs when an ELB load balancer policy uses weak ciphers such as RC4, DES, export-grade ciphers, or other cryptographically vulnerable cipher suites that are susceptible to attacks.\n\nWeak ciphers can allow attackers to compromise the confidentiality and integrity of data in transit through various cryptographic attacks like BEAST, POODLE, SWEET32, and others. This puts sensitive data passing through your load balancer at risk of being intercepted, decrypted, or modified. The security risk is particularly high for applications handling financial, personal, or other sensitive information.\n\nTo properly secure your ELB, avoid using weak ciphers in your SSL negotiation policies. Instead, use only modern, strong cipher suites in your 'aws_load_balancer_policy' resources. For Classic Load Balancers, consider using one of the recommended AWS security policies like 'ELBSecurityPolicy-TLS-1-2-2017-01' rather than creating custom policies with individual ciphers. If you must create custom policies, only include strong ciphers like those using AES-GCM with ECDHE key exchange.\n\nRegularly review and update your SSL/TLS configurations to remove newly discovered weak ciphers and protocols. This ensures your load balancers maintain strong encryption as cryptographic standards evolve and new vulnerabilities are discovered. Implementing proper TLS configurations is essential for meeting compliance requirements such as PCI DSS, HIPAA, and other standards that mandate the protection of data in transit with strong encryption."
}
