{
  "id": "ad5b4e97-2850-4adf-be17-1d293e0b85ee",
  "queryName": "Glue Security Configuration Encryption Disabled",
  "severity": "HIGH",
  "category": "Encryption",
  "descriptionText": "Glue Security Configuration Encryption should have 'cloudwatch_encryption', 'job_bookmarks_encryption' and 's3_encryption' enabled",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/glue_security_configuration#encryption_configuration",
  "platform": "Terraform",
  "descriptionID": "839261d5",
  "cloudProvider": "aws",
  "cwe": "311",
  "detailedDescriptionText": "AWS Glue Security Configurations should have all encryption options properly configured to protect sensitive ETL data and metadata. This vulnerability occurs when a Glue Security Configuration is created with incomplete encryption settings for CloudWatch logs, job bookmarks, or S3 data.\n\nWhen encryption is not properly configured for all components of a Glue ETL job, sensitive data processed by Glue could be exposed. Glue jobs often process large volumes of data that may contain personal information, financial records, or other confidential information. Each encryption component protects different aspects of the Glue workflow: S3 encryption protects data at rest in S3 buckets, CloudWatch encryption protects log data, and job bookmarks encryption protects metadata about job progress.\n\nTo properly secure your Glue environment, configure all three encryption components in your 'aws_glue_security_configuration' resource: 'cloudwatch_encryption', 'job_bookmarks_encryption', and 's3_encryption'. For each component, specify the appropriate encryption mode (such as 'SSE-KMS' or 'CSE-KMS') and provide a valid KMS key ARN when required. Using customer-managed KMS keys rather than AWS managed keys gives you greater control over key rotation, access policies, and provides better auditability.\n\nImplementing comprehensive encryption for AWS Glue is not only a security best practice but also essential for meeting compliance requirements such as GDPR, HIPAA, PCI DSS, and other regulatory standards that mandate the protection of sensitive data throughout processing pipelines. By ensuring all components are encrypted, you establish a complete end-to-end security model for your ETL workloads."
}
