{
  "id": "cc997676-481b-4e93-aa81-d19f8c5e9b12",
  "queryName": "EBS Volume Encryption Disabled",
  "severity": "HIGH",
  "category": "Encryption",
  "descriptionText": "EBS volumes should be encrypted",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/ebs_volume#encrypted",
  "platform": "Terraform",
  "descriptionID": "977695a1",
  "cloudProvider": "aws",
  "cwe": "311",
  "oldSeverity": "MEDIUM",
  "detailedDescriptionText": "AWS EBS volumes should always be encrypted to protect sensitive data stored on them. This vulnerability occurs when an EBS volume is created with the 'encrypted' attribute explicitly set to false or when the attribute is omitted (as it defaults to false unless account-level encryption is enabled).\n\nUnencrypted EBS volumes pose significant security risks, as the data stored on these volumes is vulnerable to unauthorized access if the underlying storage media is compromised, if snapshots are accessed inappropriately, or if the EC2 instance is terminated and the storage is reassigned. This is especially concerning for volumes containing sensitive information such as personal data, credentials, application code, or business-critical information.\n\nTo properly secure your EBS volumes, explicitly set the 'encrypted' attribute to true in your 'aws_ebs_volume' resource. For enhanced security, you can also specify a customer-managed KMS key using the 'kms_key_id' attribute rather than relying on the default AWS managed key. This gives you more control over key rotation, access policies, and provides better auditability.\n\nImplementing encryption for EBS volumes is a fundamental security practice that helps meet compliance requirements such as GDPR, HIPAA, PCI DSS, and other regulatory standards that mandate the protection of sensitive data. It provides an additional layer of defense with minimal performance impact, helping to protect your organization from data breaches and regulatory violations. As a best practice, consider also enabling default EBS encryption at the account level to ensure all newly created volumes are automatically encrypted."
}
