{
  "id": "b1ffa705-19a3-4b73-b9d0-0c97d0663842",
  "queryName": "IAM Role With Full Privileges",
  "severity": "HIGH",
  "category": "Access Control",
  "descriptionText": "IAM role policy that allow full administrative privileges (for all resources)",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/iam_role",
  "platform": "Terraform",
  "descriptionID": "81321ef4",
  "cloudProvider": "aws",
  "cwe": "732",
  "detailedDescriptionText": "AWS IAM roles should never be configured with policies that grant full administrative privileges to all resources. This vulnerability occurs when a role's trust policy or attached policies use wildcards for actions ('*' or ['*']) combined with unrestricted resource specification ('*'), creating a significant security risk.\n\nRoles with unrestricted privileges violate the principle of least privilege and substantially increase the potential impact of credential compromise or misuse. If an entity assumes a role with full administrative privileges, it can perform any action on any resource within the AWS account, potentially leading to unauthorized access, data exfiltration, resource manipulation, or complete account takeover. This risk is amplified when these roles are used by applications, services, or in cross-account scenarios.\n\nTo properly secure your AWS environment, always implement the principle of least privilege by defining IAM roles with only the specific permissions required for their intended function. Instead of using wildcards, explicitly list only the required actions in trust policies and role policies, and limit the scope to specific resources by providing their exact ARNs. Additionally, implement conditions in role trust policies to further restrict when and how the role can be assumed.\n\nRegularly review and audit your IAM roles and their associated policies to identify and remediate overly permissive configurations. Use AWS CloudTrail to monitor role assumption activities and implement alerts for suspicious behavior. By following these practices, you can significantly reduce the risk of unauthorized access and limit the potential impact if a security breach occurs."
}
