{
  "id": "b187edca-b81e-4fdc-aff4-aab57db45edb",
  "queryName": "SQL DB Instance Publicly Accessible",
  "severity": "CRITICAL",
  "category": "Insecure Configurations",
  "descriptionText": "Cloud SQL instances should not be publicly accessible.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/sql_database_instance",
  "platform": "Terraform",
  "descriptionID": "9beef444",
  "cloudProvider": "gcp",
  "cwe": "732",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Making Google Cloud SQL instances publicly accessible creates a critical security vulnerability that significantly increases the risk of unauthorized access, data breaches, and compliance violations. Database instances should always be protected behind private networks with carefully controlled access paths.\n\nWhen a Cloud SQL instance is configured with a public IP address (when 'ipv4_enabled' is set to true without appropriate authorized networks restrictions), it becomes potentially accessible from the public internet. This exposes your database to a wide range of security threats and unnecessary risks.\n\nThe specific security risks of publicly accessible SQL instances include:\n\n1. Expanded Attack Surface: Public databases are visible to automated scanning tools and potential attackers worldwide, making them targets for brute force attacks, vulnerability exploitation, and unauthorized access attempts.\n\n2. Credential-Based Risks: If database credentials are compromised through any means (code repositories, phishing, etc.), a publicly accessible database can be immediately accessed without additional network-level protections.\n\n3. Zero-Day Vulnerabilities: Public exposure increases risk from yet-unknown vulnerabilities in database software that could be exploited before patches are available.\n\n4. Compliance Violations: Many regulatory frameworks (PCI-DSS, HIPAA, GDPR, etc.) have strict requirements for database protection that may be violated by public accessibility.\n\nTo properly secure your Cloud SQL instances:\n1. Use private IP addresses instead of public IPs whenever possible\n2. If public IP is required, strictly limit authorized networks to specific, trusted IP ranges\n3. Implement Cloud SQL Auth Proxy for secure access without exposing database ports directly\n4. Use SSL/TLS encryption for all connections\n5. Configure and enforce strong authentication mechanisms\n6. Implement VPC Service Controls where appropriate\n7. Regularly audit access logs for suspicious activity\n\nProtecting database instances with proper network isolation is a fundamental security practice that significantly reduces your overall risk posture. By keeping databases private, you add an essential layer of defense against unauthorized access and potential data breaches."
}
