{
  "id": "7af43613-6bb9-4a0e-8c4d-1314b799425e",
  "queryName": "S3 Bucket Access to Any Principal",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "S3 Buckets must not allow Actions From All Principals, as to prevent leaking private information to the entire internet or allow unauthorized data tampering / deletion. This means the 'Effect' must not be 'Allow' when there are All Principals",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/s3_bucket_policy",
  "platform": "Terraform",
  "descriptionID": "4f884b47",
  "cloudProvider": "aws",
  "cwe": "284",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Granting access to an S3 bucket to any principal ('*' or 'AWS: *') creates a critical security vulnerability that exposes your data to potential unauthorized access, modification, or deletion by anyone on the internet. This configuration violates the fundamental security principle of least privilege and creates a publicly accessible bucket.\n\nWhen an S3 bucket policy includes statements with 'Effect': 'Allow' and 'Principal': '*' or 'Principal': {'AWS': '*'}, it essentially removes all access controls, making your bucket and its contents accessible to anyone who discovers it. Even read-only access can expose sensitive information, while write or delete permissions could lead to data tampering or complete data loss.\n\nThese security issues can lead to:\n1. Data breaches exposing confidential or sensitive information\n2. Regulatory compliance violations (GDPR, HIPAA, PCI-DSS, etc.)\n3. Malware injection or hosting of malicious content\n4. Data loss or corruption\n5. Excessive AWS charges due to unauthorized access and data transfer\n\nTo secure your S3 buckets:\n1. Always specify explicit AWS accounts or IAM roles in the Principal element\n2. Enable S3 Block Public Access at both bucket and account levels\n3. Use IAM policies with conditions to restrict access based on source IP, VPC endpoint, or other contextual attributes\n4. Implement least privilege access by granting only the specific permissions required\n5. Regularly audit bucket policies and access logs to detect potential misconfigurations\n\nSecuring S3 buckets properly is essential for maintaining data security in AWS environments. By restricting access to only authenticated and authorized entities, you significantly reduce the risk of data exposures and security incidents."
}
