{
  "id": "c2a3efb6-8a58-481c-82f2-bfddf34bb4b7",
  "queryName": "CosmosDB Account IP Range Filter Not Set",
  "severity": "CRITICAL",
  "category": "Networking and Firewall",
  "descriptionText": "The IP range filter should be defined to secure the data stored",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/cosmosdb_account#ip_range_filter",
  "platform": "Terraform",
  "descriptionID": "fd34a2d6",
  "cloudProvider": "azure",
  "cwe": "285",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Failing to configure IP range filters for Azure Cosmos DB accounts creates a critical security vulnerability that could allow unauthorized access to your database from any IP address on the internet. This significantly increases the risk of data breaches, unauthorized data manipulation, and other security incidents.\n\nWhen a Cosmos DB account is created without IP range filters (when the 'ip_range_filter' attribute is not set or is empty), the database effectively accepts connections from any source IP address by default. This means that anyone who obtains the connection string or keys can access your database from anywhere in the world, bypassing a critical security boundary.\n\nThe specific risks of not setting IP range filters include:\n\n1. Expanded Attack Surface: Without IP filtering, your database is exposed to potential brute force attacks, unauthorized access attempts, and exploitation of vulnerabilities from any location globally.\n\n2. Increased Risk from Credential Exposure: If access keys or connection strings are accidentally leaked (through code repositories, logs, etc.), they can be used from any IP address without additional barriers.\n\n3. Compliance Violations: Many regulatory standards require network-level controls for database access, which IP filtering helps satisfy.\n\n4. Limited Auditing Capability: Without IP restrictions, it becomes more difficult to distinguish between legitimate and potentially malicious access attempts.\n\nTo properly secure your Cosmos DB accounts:\n1. Always define IP range filters to restrict access to known, trusted IP ranges such as your application servers, VPNs, or corporate networks\n2. Use the 'ip_range_filter' attribute to specify a comma-separated list of IP addresses or CIDR ranges\n3. Combine IP filtering with other security measures like Private Link, Virtual Network Service Endpoints, and strict RBAC policies\n4. Regularly review and update IP ranges as your network architecture evolves\n5. Consider implementing Azure Private Endpoints for the highest level of network isolation\n\nImplementing IP range filters is a fundamental security practice for Cosmos DB accounts and provides an essential layer of defense against unauthorized access attempts."
}
