{
  "id": "030d3b18-1821-45b4-9e08-50efbe7becbb",
  "queryName": "Amazon DMS Replication Instance Is Publicly Accessible",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "Amazon DMS is publicly accessible, therefore exposing possible sensitive information. To prevent such a scenario, update the attribute 'PubliclyAccessible' to false.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/dms_replication_instance",
  "platform": "Terraform",
  "descriptionID": "e9791a4b",
  "cloudProvider": "aws",
  "cwe": "668",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "AWS Database Migration Service (DMS) replication instances should never be publicly accessible from the internet. When a DMS replication instance is configured with 'publicly_accessible' set to true, it allows connections from outside of the VPC, creating a significant security risk and potentially exposing sensitive data during migration.\n\nPublic accessibility exposes your replication instance to a wide range of threats, including unauthorized access attempts, brute force attacks, and potential data exfiltration. DMS instances often handle sensitive data during migration processes, making them high-value targets for attackers. A compromised DMS instance could lead to data breaches, data loss, or unauthorized modification of your databases during migration.\n\nTo mitigate this risk, always set 'publicly_accessible' to false (or omit it, as false is the default value) and use private VPC endpoints or VPN connections for secure access to your DMS replication instances. Additionally, implement strict security groups that only allow necessary traffic from specific sources, use encryption for data in transit and at rest, and regularly monitor your DMS instances for suspicious activities.\n\nProper network isolation is a critical security practice for database migration services, especially when handling production or sensitive data. By keeping your DMS replication instances private, you significantly reduce your attack surface and help maintain the confidentiality and integrity of your data during migration processes."
}