{
  "id": "a6cd52a1-3056-4910-96a5-894de9f3f3b3",
  "queryName": "Cloud Storage Anonymous or Publicly Accessible",
  "severity": "CRITICAL",
  "category": "Access Control",
  "descriptionText": "Cloud Storage Buckets must not be anonymously or publicly accessible, which means the attribute 'members' must not possess 'allUsers' or 'allAuthenticatedUsers'",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/storage_bucket_iam#google_storage_bucket_iam_binding",
  "platform": "Terraform",
  "descriptionID": "fd990360",
  "cloudProvider": "gcp",
  "cwe": "732",
  "oldSeverity": "HIGH",
  "detailedDescriptionText": "Making Google Cloud Storage buckets publicly accessible creates a critical security vulnerability that can lead to data breaches, unauthorized access, and compliance violations. When bucket IAM policies include 'allUsers' or 'allAuthenticatedUsers' in the members list, you're effectively opening your data to the entire internet or to anyone with any Google account, respectively.\n\nPublicly accessible storage buckets have been the root cause of numerous high-profile data exposures across industries. Even read-only public access can lead to sensitive data leakage, while write access could allow malicious actors to tamper with your data or use your bucket to distribute malware.\n\nSpecific risks of public bucket access include:\n\n1. Data Exposure: Confidential files, backups, logs, or personal information could be exposed to anyone on the internet.\n\n2. Data Tampering: With write access, attackers can modify or delete your data, potentially disrupting business operations.\n\n3. Malware Distribution: Public buckets can be used to host malicious content, potentially making your organization complicit in attacks.\n\n4. Compliance Violations: Public data access likely violates GDPR, HIPAA, PCI-DSS, and other regulatory requirements for controlled data access.\n\n5. Reputation Damage: Public data breaches can severely damage customer trust and company reputation.\n\nTo properly secure your Cloud Storage buckets:\n1. Never use 'allUsers' or 'allAuthenticatedUsers' in bucket IAM policies\n2. Apply the principle of least privilege by granting access only to specific service accounts or user identities\n3. Use signed URLs with expiration times for temporary public access when needed\n4. Enable Cloud Audit Logs for storage bucket access and regularly review for unauthorized access attempts\n5. Consider implementing Object Versioning to protect against malicious deletions\n6. Regularly audit bucket permissions using tools like Security Command Center\n\nProperly securing Cloud Storage buckets is essential for protecting sensitive data and maintaining compliance with security standards and regulations."
}
