{
  "id": "1a690d1d-0ae7-49fa-b2db-b75ae0dd1d3e",
  "queryName": "Aurora With Disabled at Rest Encryption",
  "severity": "HIGH",
  "category": "Encryption",
  "descriptionText": "Amazon Aurora does not have encryption for data at rest enabled. To prevent such a scenario, update the attribute 'StorageEncrypted' to 'true'.",
  "descriptionUrl": "https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/rds_cluster#storage_encrypted",
  "platform": "Terraform",
  "descriptionID": "3e7eea78",
  "cloudProvider": "aws",
  "cwe": "311",
  "detailedDescriptionText": "Amazon Aurora databases should always be configured with encryption at rest enabled to protect sensitive data. When the 'storage_encrypted' attribute is set to false or omitted in your Terraform configuration, the database cluster will be created with unencrypted storage, putting all stored data at risk if the underlying storage is compromised.\n\nUnencrypted database storage poses significant security risks, especially for databases that contain sensitive information such as personal identifiable information (PII), financial data, healthcare records, or proprietary business information. Without encryption, data could be exposed if backup files are accessed inappropriately, when hardware is decommissioned, or through direct access to the storage media.\n\nTo properly secure your Aurora cluster, set the 'storage_encrypted' attribute to 'true' in your 'aws_rds_cluster' resource configuration. By default, Aurora will use an AWS managed KMS key, but for enhanced security, you can also specify a customer-managed KMS key using the 'kms_key_id' attribute, giving you more control over key rotation and access policies.\n\nEncryption at rest for Amazon Aurora is especially important because it provides an additional layer of data protection with minimal performance impact. It helps meet compliance requirements for various regulations like GDPR, HIPAA, PCI DSS, and others that mandate the protection of sensitive data. Additionally, when encryption is enabled during cluster creation, all automated backups, snapshots, and replicas of the cluster are also encrypted automatically."
}
